{
    "nav": {
        "home": "Home",
        "works": "Works",
        "contact": "Contact me",
        "source": "Source Code"
    },
    "home": {
        "banner":"Hello, I'm a Software Engineer base in Mexico!",
        "experience": "+3 years",
        "name": "Angel L. Valdés",
        "description": "Web Developer (Full-Stack)",
        "bio": "Biography",
        "resume": "With over 4 years of web development expertise, I specialize in crafting dynamic, responsive, and user-focused solutions. My proficiency in modern technologies, dedication to clean and efficient code, and passion for delivering impactful user experiences set me apart. Currently, I contribute to the development of high-impact projects, showcasing my ability to solve complex challenges and drive innovation. Check out my latest work on ",
        "currentProject": {
            "label": "ωεβ Τσφδ",
            "url": "/works/web-tools"
        },
        "timeline": [
            {
                "date": "Sep-2024 to Present",
                "title": "Master's Degree in Software Engineering",
                "description": "I am currently pursuing a Master’s degree in Software Engineering at the Technological University of the Mixteca (UTM) in Oaxaca, Mexico.",
                "icon": "rocketLaunch"
            },
            {
                "date": "Dec-2022 to Oct-2024",
                "title": "GENTALIA.SA",
                "description": "From the position of a Full-Stack Developer, I had the opportunity to work with technologies such as Angular and Spring Boot on high-impact projects in high-risk sectors in Spain.",
                "icon": "briefcase"
            },
            {
                "date": "Jan-2022 to Jan-2024",
                "title": "CUJAE University",
                "description": "I started working as a specialist in the Directorate of ICT Services (DISERTIC) at the Technological University of Havana José Antonio Echeverría (CUJAE).",
                "icon": "buildingLibrary"
            },
            {
                "date": "Sep-2016 to Dec-2021",
                "title": "Computer Science Degree",
                "description": "I pursued a degree in Computer Science at the University of Computer Science (UCI) in Havana.",
                "icon": "academicCap"
            }
        ]
    },
    "works": {
        "title": "Projects",
        "more": "More",
        "goToWeb": "go to website",
        "website": "Website",
        "sourceCode": "Source Code",
        "stack": "Stack",
        "projects": [
            {
                "id":"web-tools",
                "title": "ωεβ Τσφδ",
                "year":"2024",
                "shortDescription": "A comprehensive collection of web resources and tools",
                "longDescription": "Web Tools is an innovative web project designed to streamline access to a curated collection of web tools and resources, powered by Astro and integrated with the Notion API as its database. This platform aims to serve developers, designers, entrepreneurs, and anyone looking to enhance their online presence with efficient and user-friendly digital tools.",
                "website": "https://web-tools.vercel.app/",
                "sourceCode": "https://github.com/alvaldes/web-tools",
                "platform": "Web",
                "active": 1,
                "stack": "Astro, TailwindCSS, Notion API",
                "thumbCard": "/images/web-tools/thumbCard.webp",
                "thumbFirst":"/images/web-tools/thumbFirst.webp",
                "thumbMockup":"/images/web-tools/thumbMockup.webp"
            },
            {
                "id":"search-intranet",
                "title": "search-intranet",
                "year":"2022",
                "shortDescription": "A search engine to CUJAE 's Intranet",
                "longDescription": "At the José Antonio Echeverría University (CUJAE) in Havana, Cuba, there is a search engine for the Intranet. This engine is not only efficient in searching and locating relevant information, but it also interacts with a Lightweight Directory Access Protocol (LDAP). In the case of CUJAE, this allows the search engine to access directory information, such as user details and network structure, to provide more accurate and personalized search results. It’s worth noting that this search engine is only available on the internal network of the university campus.",
                "website": "university campus network",
                "sourceCode": "https://github.com/alvaldes/search-intranet",
                "platform": "Web",
                "active": 1,
                "stack": "React.JS, TailwindCSS",
                "thumbCard": "/images/search-intranet/thumbCard.webp",
                "thumbFirst":"/images/search-intranet/thumbFirst.webp",
                "thumbMockup":"/images/search-intranet/thumbMockup.webp"
            },
            {
                "id":"aterm",
                "title": "aterm",
                "year":"2022",
                "shortDescription": "A interactive portfolio web terminal.",
                "longDescription": "**aterm** is a static website or portfolio, that looks like a terminal. But it’s much better if someone that visits the web page, can actually type some commands and get the output like in a real styled terminal. You can call it Fake Terminal because it will not give you what a real shell-like SSH gives you.",
                "website": "https://aterm.netlify.app/",
                "sourceCode": "https://github.com/alvaldes/aterm",
                "platform": "Web",
                "active": 1,
                "stack": "HTML, CSS, JavaScript",
                "thumbCard": "/images/aterm/thumbCard.webp",
                "thumbFirst":"/images/aterm/thumbFirst.webp",
                "thumbMockup":"/images/aterm/thumbMockup.webp"
            },
            {
                "id": "trivial",
                "title": "Trivial",
                "year":"2021",
                "shortDescription": "A game where players are asked questions on different topics and have to get as many answers as possible right.",
                "longDescription": "**Trivial** is a type of game in which players are asked questions about different topics and they have to get as many correct answers as possible. Besides having the benefit of improving and expanding your knowledge, either general or in more specific areas, this style of game is designed so that the contestants have fun playing, and its main objective is to create discussion and healthy debate among participants. In fact it is not mandatory that Trivia winners have to get a prize and almost everyone is ok with that as their main objective is to have fun and learn at the same time. Trivia questions and answers can be adapted to any audience and can be used in schools and universities to assist in language skills development and to test knowledge and skills levels.",
                "website": "https://trivial.alvaldes.vercel.app",
                "sourceCode": "https://github.com/alvaldes/Trivial",
                "platform": "Web",
                "active": 1,
                "stack": "JavaScript, NodeJS, ReactJS, NextJS, Chackra-UI",
                "thumbCard": "/images/trivial/thumbCard.webp",
                "thumbFirst": "/images/trivial/thumbFirst.webp",
                "thumbMockup": "/images/trivial/thumbMockup.webp"
            }
        ]
    },
    "footer": {
        "contact_me": "Contact Me 🧑‍💻",
        "to": "to:",
        "mail": "alvaldes.dev@gmail.com",
        "subject": "Subject:",
        "subject_text": "Portfolio Inquiry: Let's Connect!",
        "message": "Message",
        "message_text": "Enter your message",
        "send": "Send",
        "error": "You need to specify the message before sending.",
        "copy1": "Thanks to",
        "copy2": "for the inspiration.",
        "buyMeACoffee": "Buy me a coffee!"
    }
}