{
    "nav": {
        "home": "Inicio",
        "works": "Trabajos",
        "contact": "Contáctame",
        "source": "Código"
    },
    "home": {
        "banner":"Hola, soy un Ingeniero de Software residente en Cuba.!",
        "experience": "+3 años",
        "name": "Angel L. Valdés",
        "description": "Desarrollador Web (Full-Stack)",
        "bio": "Biografía",
        "resume": "Con 3 años de experiencia como desarrollador web, sobresalgo en la creación de soluciones dinámicas y responsivas. Mi distintiva combinación de habilidades en tecnologías de vanguardia, dedicación al código limpio y eficiente, junto con una pasión por el diseño centrado en el usuario, me coloca en una posición única. Actualmente, contribuyo significativamente al desarrollo de proyectos destacados, como el trabajo en ",
        "currentProject": {
            "label": "Aterm",
            "url": "/work/aterm"
        }
    },
    "works": {
        "title": "Proyectos",
        "more": "Más",
        "goToWeb": "ir al Sitio",
        "website": "Sitio Web",
        "sourceCode": "Código",
        "stack": "Stack",
        "projects": [
            {
                "id":"web-tools",
                "title": "ωεβ Τσφδ",
                "year":"2024",
                "shortDescription": "Una colección completa de recursos y herramientas web.",
                "longDescription": "Web Tools es un proyecto web innovador diseñado para simplificar el acceso a una colección seleccionada de herramientas y recursos web, impulsado por Astro e integrado con la API de Notion como su base de datos. Esta plataforma tiene como objetivo servir a desarrolladores, diseñadores, empresarios y cualquier persona que busque mejorar su presencia en línea con herramientas digitales eficientes y fáciles de usar.",
                "website": "https://web-tools.vercel.app/",
                "sourceCode": "https://github.com/alvaldes/web-tools",
                "platform": "Web",
                "active": 1,
                "stack": "Astro, TailwindCSS, Notion API",
                "thumbCard": "/images/web-tools/thumbCard.webp",
                "thumbFirst":"/images/web-tools/thumbFirst.webp",
                "thumbMockup":"/images/web-tools/thumbMockup.webp"
            },
            {
                "id":"search-intranet",
                "title": "search-intranet",
                "year":"2022",
                "shortDescription": "Un motor de búsqueda para la Intranet de CUJAE.",
                "longDescription": "En la Universidad José Antonio Echeverría (CUJAE) de la Habana, Cuba, se ha implementado un motor de búsqueda para la Intranet. Este motor no solo es eficiente para buscar y localizar información relevante, sino que también interactúa con un Servicio de Directorio Ligero de Acceso a Directorios (LDAP). En el caso de CUJAE, esto permite que nuestro motor de búsqueda acceda a la información del directorio, como los detalles del usuario y la estructura de la red, para proporcionar resultados de búsqueda más precisos y personalizados. Cabe destacar que este motor de búsqueda está disponible solo en la red interna de nuestro campus universitario.",
                "website": "red del campus universitario",
                "sourceCode": "https://github.com/alvaldes/search-intranet",
                "platform": "Web",
                "active": 1,
                "stack": "React.JS, TailwindCSS",
                "thumbCard": "/images/search-intranet/thumbCard.webp",
                "thumbFirst":"/images/search-intranet/thumbFirst.webp",
                "thumbMockup":"/images/search-intranet/thumbMockup.webp"
            },
            {
                "id":"aterm",
                "title": "aterm",
                "year":"2022",
                "shortDescription": "Una terminal web interactiva para portfolios.",
                "longDescription": "**aterm** es un sitio web estático o portfolio que simula una terminal. Sin embargo, la experiencia mejora considerablemente cuando los visitantes pueden interactuar escribiendo comandos y obtener resultados, similar a una terminal real. Puedes llamarlo Terminal Falso, ya que no ofrece las capacidades completas de un shell real, como SSH.",
                "website": "https://aterm.netlify.app/",
                "sourceCode": "https://github.com/alvaldes/aterm",
                "platform": "Web",
                "active": 1,
                "stack": "HTML, CSS, JavaScript",
                "thumbCard": "/images/aterm/thumbCard.webp",
                "thumbFirst":"/images/aterm/thumbFirst.webp",
                "thumbMockup":"/images/aterm/thumbMockup.webp"
            },
            {
                "id": "trivial",
                "title": "Trivial",
                "year":"2021",
                "shortDescription": "Un juego donde los jugadores responden preguntas sobre diferentes temas y tratan de acertar la mayor cantidad posible.",
                "longDescription": "**Trivial** es un tipo de juego en el cual los participantes responden preguntas sobre diversos temas con el objetivo de obtener la mayor cantidad de respuestas correctas posible. Además de mejorar y ampliar el conocimiento, ya sea de manera general o en áreas más específicas, este estilo de juego está diseñado para que los concursantes se diviertan mientras participan. Su principal objetivo es fomentar la discusión y el debate saludable entre los participantes. De hecho, no es obligatorio que los ganadores de la Trivia reciban un premio y casi todos están de acuerdo con eso, ya que el principal objetivo es disfrutar y aprender al mismo tiempo. Las preguntas y respuestas de la Trivia se pueden adaptar a cualquier audiencia y pueden utilizarse en escuelas y universidades para ayudar en el desarrollo de habilidades lingüísticas y evaluar niveles de conocimiento y habilidades.",
                "website": "https://trivial.alvaldes.vercel.app",
                "sourceCode": "https://github.com/alvaldes/Trivial",
                "platform": "Web",
                "active": 1,
                "stack": "JavaScript, Node.JS, React.JS, Next.JS, Chackra-UI",
                "thumbCard": "/images/trivial/thumbCard.webp",
                "thumbFirst": "/images/trivial/thumbFirst.webp",
                "thumbMockup": "/images/trivial/thumbMockup.webp"
            }
        ]
    },
    "footer": {
        "contact_me": "Escribeme 🧑‍💻",
        "to": "a:",
        "mail": "angelluis2605@gmail.com",
        "subject": "Asunto:",
        "subject_text": "Consulta del portafolio: ¡Conectemos!",
        "message": "Mensaje",
        "message_text": "Ingresa el mensaje aquí",
        "send": "Enviar",
        "error": "Debe especificar el mensaje antes de enviarlo.",
        "copy1": "Gracias a",
        "copy2": "por su inspiración."
    }
}