{
    "nav": {
        "home": "Inicio",
        "works": "Trabajos",
        "contact": "Contactame",
        "source": "Código"
    },
    "home": {
        "banner":"Hola, soy un Ingeniero de Software residente en Cuba.!",
        "experience": "+3 años",
        "name": "Angel L. Valdés",
        "description": "Desarrollador Web (Full-Stack)",
        "bio": "Biografía",
        "resume": "Angel es un ingeniero informático recién graduado que ofrece entusiasmo e ideas innovadoras. Experiencia demostrada en programación web y apasionado por las interfaces dinámicas y el código limpio. Experiencia trabajando con equipos para producir sitios web impactantes y de vanguardia que atraigan a los clientes y brinden resultados comerciales. Conocedor de los estándares de diseño y las preferencias del usuario. La experiencia incluye el diseño de sitios web responsivos en entornos ágiles. Trabajador de equipo excepcional con un enfoque analítico para desarrollar soluciones útiles. Actualmente, trabajando en ",
        "currentProject": {
            "label": "Aterm",
            "url": "/work/aterm"
        }
    },
    "works": {
        "title": "Projects",
        "more": "More",
        "goToWeb": "go to website",
        "website": "Website",
        "sourceCode": "Source Code",
        "stack": "Stack",
        "projects": [
            {
                "id":"aterm",
                "title": "aterm",
                "year":"2022",
                "shortDescription": "A interactive portfolio web terminal.",
                "longDescription": "**aterm** is a static website or portfolio, that looks like a terminal. But it’s much better if someone that visits the web page, can actually type some commands and get the output like in a real styled terminal. You can call it Fake Terminal because it will not give you what a real shell-like SSH gives you.",
                "website": "https://aterm.netlify.app/",
                "sourceCode": "https://github.com/alvaldes/aterm",
                "platform": "Web",
                "active": 1,
                "stack": "HTML, CSS, JavaScript",
                "thumbCard": "/images/aterm/thumbCard.webp",
                "thumbFirst":"/images/aterm/thumbFirst.webp",
                "thumbMockup":"/images/aterm/thumbMockup.webp"
            },
            {
                "id": "trivial",
                "title": "Trivial",
                "year":"2022",
                "shortDescription": "A game where players are asked questions on different topics and have to get as many answers as possible right.",
                "longDescription": "**Trivial** is a type of game in which players are asked questions about different topics and they have to get as many correct answers as possible. Besides having the benefit of improving and expanding your knowledge, either general or in more specific areas, this style of game is designed so that the contestants have fun playing, and its main objective is to create discussion and healthy debate among participants. In fact it is not mandatory that Trivia winners have to get a prize and almost everyone is ok with that as their main objective is to have fun and learn at the same time. Trivia questions and answers can be adapted to any audience and can be used in schools and universities to assist in language skills development and to test knowledge and skills levels.",
                "website": "https://trivial.alvaldes.vercel.app",
                "sourceCode": "https://github.com/alvaldes/Trivial",
                "platform": "Web",
                "active": 1,
                "stack": "JavaScript, Node.JS, React.JS, Next.JS, Chackra-UI",
                "thumbCard": "/images/trivial/thumbCard.webp",
                "thumbFirst": "/images/trivial/thumbFirst.webp",
                "thumbMockup": "/images/trivial/thumbMockup.webp"
            }
        ]
    },
    "footer": {
        "contact_me": "Escribeme 🧑‍💻",
        "to": "a:",
        "mail": "angelluis2605@gmail.com",
        "subject": "Asunto:",
        "subject_text": "Consulta del portafolio: ¡Conectemos!",
        "message": "Mensaje",
        "message_text": "Ingresa el mensaje aquí",
        "send": "Enviar",
        "error": "Debe especificar el mensaje antes de enviarlo.",
        "copy1": "Gracias a",
        "copy2": "por su inspiración."
    }
}